//=====数组指针======

char a[5]={1,2,3,4,5};
char (*p3)[5]=&a;    //也可以指向一维
char (*p4)[5]=(char (*)[5])a;    //必须强制类型转换一下，不然编辑阶段出错

cout<<&a<<" "<<p3+1<<" "<<p4+1<<endl;   //0x7ffce31b1880 0x7ffce31b1885 0x7ffce31b1885

//===a和&a====
int a[5]={1,2,3,4,5};

int *p1=(int *)(&a+1);
int *p2=(int *)((int)a+1);    //CLion又通不过，int *转int报错

printf("%x %x",*(p1-1),*p2); 
/*--方法---
第一个好说
第二个先写出a的数组内存分配，小端模式下由低地址到高地址: 01 00 00 00,02 00 00 00,03 00 00 00....
int(a)+1 是从第一个元素的第二个字节处开始取为 00 00 00 02，所以*p2为0x2 00 00 00
*/


